###############################################################
####
####	.irbrc (irbの設定ファイル)
####
###############################################################

# インストール 起動前

# gem install wirble
# gem install irb_rocket
# gem install what_methods
# gem install tapp
# gem install ruby-terminfo
# gem install utility_belt



###############################################################

#uconvをインストール。
# sudo apt-get install libuconv-ruby1.8
# sudo apt-get install libuconv-ruby1.9.1


# cd ~/Downloads
# wget http://www.yoshidam.net/uconv-0.5.3.tar.gz
# tar zxvf uconv-0.5.3.tar.gz
# cd uconv
# ruby extconf.rb
# make
# make install

# sudo apt-get install libxml2-dev libxslt-dev
# sudo apt-get install libxslt-dev
# gem install nokogiri



###############################################################

#win用
# gem install win32console

# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 
# gem i 



###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################

require 'rubygems'

#エイリアス
alias q exit

#utility_beltはqのエイリアスがかぶっており、
#exitのエイリアスが独自にxで設定されている。
#x でexit

begin

	#irb上でライブラリを読み込み。
#	require 'action_mailer'
#	require 'action_pack'
#	require 'active_record'
#	require 'active_resource'
#	require 'active_support'

#	require 'active_model'



#	require 'nokogiri'
#	require 'open-uri'

#	require 'rcodetools'

#	require ''
#	require ''
#	require ''
#	require ''
#	require ''
#	require ''



	#<tab>		メソッド名が補完
	#<Ctr>+p	1 つ 前の履歴を取り出す
	#<Ctr>+r	インクリメンタル検索

	## 補完を有効にする
	require 'irb/completion'

	# what? でメソッドを調べることができるようにする
	#require 'what_methods'
	#irb(main):001:0> "1234".what? 1234
	#"1234".to_i == 1234
	#"1234".to_f == 1234
	#=> ["to_i", "to_f"]

	#デバッグ関連
	require 'pp'
	#1.8.系の人は要require 'rubygems'
	#ppをさらに発展させたもの？
	#require 'tapp'

	# ヒストリの設定
	#shellの↑で履歴をたどれることができるようにする
	IRB.conf[:SAVE_HISTORY]=100000

	# オートインデント
	IRB.conf[:AUTO_INDENT]=true


##########################################################
##########################################################

#wirbleの拡張機能1
	## wirbleを使って色をつける
	#require 'wirble'
	#Wirble.init(:skip_prompt => :DEFAULT)
	#Wirble.colorize



##########################################################

#wirbleの拡張機能2
	#Ruby1.9では修正する必要がある。
	#http://d.hatena.ne.jp/suzumura_ss/20100824/1282670143
	#require 'utility_belt'

	#v(verbose)  - irbの出力結果を表示する
	#q(quiet)    - irbの出力結果を非表示にする

	#>> hoge = {:fuga => "bar" }
	#=> {:fuga=>"bar"}
	#>> hoge += {:hige => "baz"}
	#=> {:fuga=>"bar", :hige=>"baz"}
	#>> hoge -= :fuga
	#=> {:hige=>"baz"}



##########################################################

#wirbleの拡張機能3
#utility_beltよりも機能が少ないので使っていない。
#irb_rocketはwirble と ruby-terminfo に依存している。
#	require 'irb_rocket'


##########################################################
##########################################################

#require check
rescue LoadError => err
	warn "Couldn't load require: #{err}"
end




#
##(1..10).inject(0) {|x,y| x + y}
#
